//--------------------------------------------------------------------------------------------------------
// 模块： eth_reset_sync
// Type    : synthesizable
// Standard: Verilog 2001 (IEEE1364-2001)
// 功能： 各时钟域复位异步拉低、三级同步释放
// 作者： WANG
// 时间： 26.10.22
//--------------------------------------------------------------------------------------------------------
`timescale  1ns/1ns

module  eth_reset_sync
(
    input   wire                   sys_clk                ,
    input   wire                   async_rst_n            ,
    output  wire                   rst_n
);

//********************************************************************//
//****************** Parameter and Internal Signal *******************//
//********************************************************************//
//reg   define
(* ASYNC_REG = "TRUE" *) reg [2:0] rst_sync;

//********************************************************************//
//***************************** Main Code ****************************//
//********************************************************************//
assign rst_n = rst_sync[2];

always@(posedge sys_clk or negedge async_rst_n)
    if(async_rst_n == 1'b0)
        rst_sync <= 3'd0;
    else
        rst_sync <= {rst_sync[1:0], 1'b1};

endmodule
